backend: tensorflow
class_name: Model
config:
  input_layers:
  - - input_1
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 2000
      - 1
      dtype: float32
      name: input_1
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: Embedding
    config:
      activity_regularizer: null
      batch_input_shape: !!python/tuple
      - null
      - 2000
      dtype: float32
      embeddings_constraint: null
      embeddings_initializer:
        class_name: RandomUniform
        config:
          dtype: float32
          maxval: 0.05
          minval: -0.05
          seed: null
      embeddings_regularizer: null
      input_dim: 2000
      input_length: 2000
      mask_zero: false
      name: embedding
      output_dim: 128
      trainable: false
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: embedding
  - class_name: Reshape
    config:
      batch_input_shape: !!python/tuple
      - null
      - 2000
      - 128
      dtype: float32
      name: reshape
      target_shape: !!python/tuple
      - 2000
      - 128
      - 1
      trainable: true
    inbound_nodes:
    - - - embedding
        - 0
        - 0
        - {}
    name: reshape
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 128
      name: conv2d
      padding: valid
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - reshape
        - 0
        - 0
        - {}
    name: conv2d
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 4
      - 128
      name: conv2d_1
      padding: valid
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - reshape
        - 0
        - 0
        - {}
    name: conv2d_1
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 5
      - 128
      name: conv2d_2
      padding: valid
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - reshape
        - 0
        - 0
        - {}
    name: conv2d_2
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling2d
      padding: valid
      pool_size: &id002 !!python/tuple
      - !!python/object/apply:tensorflow.python.framework.tensor_shape.Dimension
        - 1998
      - 1
      strides: *id002
      trainable: true
    inbound_nodes:
    - - - conv2d
        - 0
        - 0
        - {}
    name: max_pooling2d
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling2d_1
      padding: valid
      pool_size: &id003 !!python/tuple
      - !!python/object/apply:tensorflow.python.framework.tensor_shape.Dimension
        - 1997
      - 1
      strides: *id003
      trainable: true
    inbound_nodes:
    - - - conv2d_1
        - 0
        - 0
        - {}
    name: max_pooling2d_1
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling2d_2
      padding: valid
      pool_size: &id004 !!python/tuple
      - !!python/object/apply:tensorflow.python.framework.tensor_shape.Dimension
        - 1996
      - 1
      strides: *id004
      trainable: true
    inbound_nodes:
    - - - conv2d_2
        - 0
        - 0
        - {}
    name: max_pooling2d_2
  - class_name: Concatenate
    config:
      axis: 1
      dtype: float32
      name: concatenate
      trainable: true
    inbound_nodes:
    - - - max_pooling2d
        - 0
        - 0
        - &id005 {}
      - - max_pooling2d_1
        - 0
        - 0
        - *id005
      - - max_pooling2d_2
        - 0
        - 0
        - *id005
    name: concatenate
  - class_name: Flatten
    config:
      data_format: channels_last
      dtype: float32
      name: flatten
      trainable: true
    inbound_nodes:
    - - - concatenate
        - 0
        - 0
        - {}
    name: flatten
  - class_name: Dense
    config:
      activation: softmax
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      name: dense
      trainable: true
      units: 2
      use_bias: true
    inbound_nodes:
    - - - flatten
        - 0
        - 0
        - {}
    name: dense
  name: model
  output_layers:
  - - dense
    - 0
    - 0
keras_version: 2.2.4-tf
